TVC Website/app/controllers/admin_controller.rb

SELECT * FROM `videos` WHERE (`videos`.`id` = 7)
---
    def show_videos
      @video = Video.find(params[:id])

SELECT * FROM `videos` WHERE (`videos`.`id` = 7)
---
    def edit_videos
      @video = Video.find(params[:id])

SELECT * FROM `videos` WHERE (`videos`.`id` = 7)
UPDATE `videos` SET `remark` = '测试测试测试测试，标题够长伐？标题够长伐？标题够长伐？标题够长', `updated_at` = '2010-03-09 04:03:21' WHERE `id` = 7
---
    def update_videos
      @video = Video.find(params[:id])
      respond_to do |format|
        if @video.update_attributes(params[:admin])