TVC Website/app/controllers/home_controller.rb

  def index
    @page_title = "阿拉首页"
    @headlines=Headline.hot_headlines
    @picture=Picture.find(3)
---
SELECT * FROM `pictures` WHERE (black_or_white=1 and id>3) LIMIT 1

  def show_post
    @post = Post.find_by_id_and_to_post(params[:id],1)
---
SELECT * FROM `posts` WHERE (`posts`.`to_post` = 1 AND `posts`.`id` = '7') LIMIT 1