TVC Website/app/controllers/information_controller.rb

  def index
    @page_title = "小组介绍"
    @post = Post.find_by_id_and_to_post(1,1)
---
SELECT * FROM `posts` WHERE (`posts`.`to_post` = 1 AND `posts`.`id` = 3) LIMIT 1