TVC Website/app/controllers/register_controller.rb

  def submit_questionnaire
    @error = []
    @error << User.validate_params(params[:person]) if User.validate_params(params[:person]).length>0
    @error << Person.validate_contact(params[:qq],params[:msn],params[:cell],params[:email])  if Person.validate_contact(params[:qq],params[:msn],params[:cell],params[:email]).length>0
    @error << Person.validate_params(params[:person]) if Person.validate_params(params[:person]).length>0
    @error << Resource.validate_params(params[:resource]) if Resource.validate_params(params[:resource]).length>0
    @error << Comment.validate_params(params[:comment]) if Comment.validate_params(params[:comment]).length>0
---
INSERT INTO `users` (`name`, `salt`, `updated_at`, `administrative`, `created_ip`, `password`, `email`, `created_at`) VALUES('131590101440.0635216960468243', '590101440.0635216960468243', '2010-03-09 04:00:18', 0, 'PRCSGI02383.ad.infosys.com', '830d1ca2c673450fb853d8e33ee6ea246ebb0b52', NULL, '2010-03-09 04:00:18')
INSERT INTO `resources` (`updated_at`, `time`, `resource`, `user_id`, `created_at`) VALUES('2010-03-02 04:22:27', '很空，业余时间都可以贡献', '', 1, '2010-03-02 04:22:27')
INSERT INTO `comments` (`idea`, `updated_at`, `theme`, `user_id`, `comment`, `created_at`) VALUES('sdfasd', '2010-03-02 04:22:27', '完美', 1, 'sdfasd', '2010-03-02 04:22:27')