TVC Website/app/controllers/video_controller.rb

SELECT * FROM `videos` WHERE (`videos`.`id` = '3') LIMIT 1
---
  def showcase
    @page_title = "视频资料"
    @video=Video.find_by_id(params[:id])